tap "aws/tap"
tap "eugenmayer/dockersync"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "microsoft/mssql-release"
brew "giflib"
brew "libpng"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "asdf"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "python@3.12"
brew "aws-sam-cli"
brew "python@3.11"
brew "awscli"
brew "bat"
brew "berkeley-db", link: true
brew "brew-cask-completion"
brew "glib"
brew "cairo"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "cfn-lint"
brew "cloc"
brew "cmake"
brew "colima"
brew "cookiecutter"
brew "libssh2"
brew "curl"
brew "deno"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docutils"
brew "fish"
brew "freetds"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "harfbuzz"
brew "openjpeg"
brew "pango"
brew "ghostscript"
brew "ghq"
brew "git"
brew "git-secrets"
brew "gnu-sed"
brew "gnu-time"
brew "go"
brew "pkgconf"
brew "gobject-introspection"
brew "grep"
brew "guile"
brew "jpeg", link: true
brew "jq"
brew "keyring", link: false
brew "kubernetes-cli"
brew "krew"
brew "libfido2"
brew "libomp"
brew "libpq"
brew "librsvg"
brew "mas"
brew "mysql"
brew "nkf"
brew "nodebrew"
brew "pdf2image", link: false
brew "peco"
brew "perl"
brew "php"
brew "poetry", link: false
brew "poppler"
brew "postgresql@14"
brew "postgresql@16", link: true
brew "protobuf"
brew "pyenv"
brew "python@3.10"
brew "tcl-tk"
brew "python@3.8"
brew "python@3.9"
brew "sops"
brew "sphinx-doc", link: false
brew "starship"
brew "stow"
brew "thefuck"
brew "tmux"
brew "tree"
brew "unison"
brew "uv"
brew "vim"
brew "virtualenv", link: false
brew "volta"
brew "wget"
brew "yarn"
brew "z"
brew "zig"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "eugenmayer/dockersync/unox"
brew "hashicorp/tap/terraform"
brew "heroku/brew/heroku"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "microsoft/mssql-release/msodbcsql18"
brew "microsoft/mssql-release/mssql-tools18"
cask "alfred", args: { appdir: "/Applications" }
cask "arctype"
cask "dash", args: { appdir: "/Applications" }
cask "dbeaver-community"
cask "discord", args: { appdir: "/Applications" }
cask "figma", args: { appdir: "/Applications" }
cask "firefox", args: { appdir: "/Applications" }
cask "font-hack-nerd-font", args: { appdir: "/Applications" }
cask "font-ricty-diminished", args: { appdir: "/Applications" }
cask "google-chrome"
cask "gcloud-cli"
cask "google-japanese-ime", args: { appdir: "/Applications" }
cask "iterm2", args: { appdir: "/Applications" }
cask "karabiner-elements", args: { appdir: "/Applications" }
cask "keeweb", args: { appdir: "/Applications" }
cask "kindle", args: { appdir: "/Applications" }
cask "microsoft-edge"
cask "notion", args: { appdir: "/Applications" }
cask "pushplaylabs-sidekick", args: { appdir: "/Applications" }
cask "rectangle"
cask "session-manager-plugin", args: { appdir: "/Applications" }
cask "sublime-text", args: { appdir: "/Applications" }
cask "tableplus"
cask "teamviewer", args: { appdir: "/Applications" }
cask "vagrant", args: { appdir: "/Applications" }
cask "vagrant-manager", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "zoom", args: { appdir: "/Applications" }
vscode "42crunch.vscode-openapi"
vscode "4ops.terraform"
vscode "anthropic.claude-code"
vscode "apollographql.vscode-apollo"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "craigmaslowski.erb"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "hridoy.rails-snippets"
vscode "humao.rest-client"
vscode "janisdd.vscode-edit-csv"
vscode "kevinrose.vsc-python-indent"
vscode "kumar-harsh.graphql-for-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mosapride.zenkaku"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "patricklee.vsnotes"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "swellaby.rust-pack"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "vincaslt.highlight-matching-tag"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "yzhang.markdown-all-in-one"
vscode "zoellner.openapi-preview"
go "github.com/spf13/cobra-cli"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/ramya-rao-a/go-outline"
go "github.com/rogpeppe/godef"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/staticcheck"
