tap "aws/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "microsoft/mssql-release"
brew "giflib"
brew "libpng"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "asdf"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "python@3.12"
brew "aws-sam-cli"
brew "awscli"
brew "bat"
brew "berkeley-db", link: true
brew "brew-cask-completion"
brew "glib"
brew "cairo"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cfn-lint"
brew "cloc"
brew "cmake"
brew "colima"
brew "cookiecutter"
brew "libssh2"
brew "curl"
brew "deno"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docutils"
brew "fish"
brew "freetds"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "harfbuzz"
brew "openjpeg"
brew "ghq"
brew "git"
brew "git-secrets"
brew "gnu-sed"
brew "gnu-time"
brew "go"
brew "pkgconf"
brew "gobject-introspection"
brew "grep"
brew "guile"
brew "jpeg", link: true
brew "jq"
brew "keyring", link: false
brew "kubernetes-cli"
brew "krew"
brew "libfido2"
brew "libomp"
brew "libpq"
brew "librsvg"
brew "mas"
brew "mysql"
brew "nkf"
brew "nodebrew"
brew "pdf2image", link: false
brew "peco"
brew "perl"
brew "php"
brew "poppler"
brew "postgresql@16", link: true
brew "protobuf"
brew "sops"
brew "sphinx-doc", link: false
brew "starship"
brew "stow"
brew "thefuck"
brew "tmux"
brew "tree"
brew "unison"
brew "uv"
brew "vim"
brew "volta"
brew "wget"
brew "yarn"
brew "z"
brew "zig"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "microsoft/mssql-release/msodbcsql18"
brew "microsoft/mssql-release/mssql-tools18"
cask "alfred", args: { appdir: "/Applications" }
cask "arctype"
cask "dash", args: { appdir: "/Applications" }
cask "dbeaver-community"
cask "discord", args: { appdir: "/Applications" }
cask "figma", args: { appdir: "/Applications" }
cask "firefox", args: { appdir: "/Applications" }
cask "font-hack-nerd-font", args: { appdir: "/Applications" }
cask "google-chrome"
cask "gcloud-cli"
cask "google-japanese-ime", args: { appdir: "/Applications" }
cask "iterm2", args: { appdir: "/Applications" }
cask "karabiner-elements", args: { appdir: "/Applications" }
cask "kindle", args: { appdir: "/Applications" }
cask "microsoft-edge"
cask "notion", args: { appdir: "/Applications" }
cask "pushplaylabs-sidekick", args: { appdir: "/Applications" }
cask "rectangle"
cask "session-manager-plugin", args: { appdir: "/Applications" }
cask "sublime-text", args: { appdir: "/Applications" }
cask "tableplus"
cask "teamviewer", args: { appdir: "/Applications" }
cask "vagrant", args: { appdir: "/Applications" }
cask "vagrant-manager", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "zoom", args: { appdir: "/Applications" }
go "github.com/spf13/cobra-cli"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/ramya-rao-a/go-outline"
go "github.com/rogpeppe/godef"
go "github.com/fatih/gomodifytags"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/staticcheck"
