tap "aws/tap"
tap "eugenmayer/dockersync"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "giflib"
brew "jpeg"
brew "libpng"
brew "apr-util"
brew "asdf"
brew "python@3.9"
brew "awscli"
brew "bat"
brew "berkeley-db", link: true
brew "brew-cask-completion"
brew "glib"
brew "pkg-config"
brew "cairo"
brew "guile"
brew "p11-kit"
brew "gnutls"
brew "emacs"
brew "cask"
brew "openldap"
brew "curl"
brew "docker", link: false
brew "fish"
brew "freetds"
brew "gh"
brew "ghq"
brew "git"
brew "git-secrets"
brew "gnu-time"
brew "go"
brew "grep"
brew "harfbuzz"
brew "jq"
brew "kubernetes-cli"
brew "krew"
brew "libpq"
brew "pango"
brew "librsvg"
brew "mas"
brew "nkf"
brew "nodebrew"
brew "peco"
brew "php"
brew "postgresql"
brew "python@3.10"
brew "python@3.8"
brew "ruby"
brew "starship"
brew "stow"
brew "thefuck"
brew "tmux"
brew "tree"
brew "unison"
brew "vim"
brew "yarn"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "aws/tap/aws-sam-cli"
brew "eugenmayer/dockersync/unox"
brew "hashicorp/tap/terraform"
brew "heroku/brew/heroku"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "alacritty", args: { appdir: "/Applications" }
cask "alfred", args: { appdir: "/Applications" }
cask "dash", args: { appdir: "/Applications" }
cask "deepl", args: { appdir: "/Applications" }
cask "discord", args: { appdir: "/Applications" }
cask "docker", args: { appdir: "/Applications" }
cask "figma", args: { appdir: "/Applications" }
cask "firefox", args: { appdir: "/Applications" }
cask "font-hack-nerd-font", args: { appdir: "/Applications" }
cask "font-ricty-diminished", args: { appdir: "/Applications" }
cask "google-chrome"
cask "google-cloud-sdk", args: { appdir: "/Applications" }
cask "google-japanese-ime", args: { appdir: "/Applications" }
cask "gyazo", args: { appdir: "/Applications" }
cask "intellij-idea", args: { appdir: "/Applications" }
cask "iterm2", args: { appdir: "/Applications" }
cask "jetbrains-toolbox", args: { appdir: "/Applications" }
cask "karabiner-elements", args: { appdir: "/Applications" }
cask "keeweb", args: { appdir: "/Applications" }
cask "kindle", args: { appdir: "/Applications" }
cask "notion", args: { appdir: "/Applications" }
cask "pushplaylabs-sidekick", args: { appdir: "/Applications" }
cask "sequel-pro", args: { appdir: "/Applications" }
cask "session-manager-plugin", args: { appdir: "/Applications" }
cask "skitch", args: { appdir: "/Applications" }
cask "sublime-text", args: { appdir: "/Applications" }
cask "teamviewer", args: { appdir: "/Applications" }
cask "vagrant", args: { appdir: "/Applications" }
cask "vagrant-manager", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "zoom", args: { appdir: "/Applications" }
